# PIMPRI CHINCHWAD UNIVERSITY
# School of Engineering and Technology
# Academic Year: 2025-2026 | Semester: V
# Course: Foundations of Data Science Lab
# Course Code: UBTML329
# Name: Samarth Prashant Patil Roll No: 06
# Assignment No.: 3

In [7]:
# applying normalization and standardization

import pandas as pd

# Dataset
data = {
    'Age': [22, 25, 28, 35, 40, 45, 52, 48, 30, 27],
    'Salary': [30000, 55000, 58000, 90000, 35000, 98000, 20000, 15000, 52000, 42000],
    'Experience_Years': [1, 2, 3, 7, 10, 9, 12, 11, 4, 3],
    'Gender': ['Male', 'Female', 'Female', 'Male', 'Female', 'Male', 'Male', 'Female', 'Male', 'Female'],
    'City': ['Pune', 'Mumbai', 'Sambhajinagar', 'Jalgaon', 'Dhule', 'Nashik', 'Devpur-Dhule', 'Chalisgaon', 'Kolhapur', 'Pune'],
    'Education': ['Bachelors', 'Masters', 'Bachelors', 'PhD', 'Masters', 'Bachelors', 'PhD', 'Bachelors', 'Masters', 'Bachelors']
}

df = pd.DataFrame(data)
print("Original Dataset:")
df

Original Dataset:

   Age  Salary  Experience_Years  Gender           City  Education
0   22   30000                 1    Male           Pune  Bachelors
1   25   55000                 2  Female         Mumbai    Masters
2   28   58000                 3  Female  Sambhajinagar  Bachelors
3   35   90000                 7    Male        Jalgaon        PhD
4   40   35000                10  Female          Dhule    Masters
5   45   98000                 9    Male         Nashik  Bachelors
6   52   20000                12    Male   Devpur-Dhule        PhD
7   48   15000                11  Female     Chalisgaon  Bachelors
8   30   52000                 4    Male       Kolhapur    Masters
9   27   42000                 3  Female           Pune  Bachelors

In [9]:
# Nomrmalization
import pandas as pd
from sklearn.preprocessing import MinMaxScaler, StandardScaler, LabelEncoder, OneHotEncoder

In [12]:
df.head()

   Age  Salary  Experience_Years  Gender           City  Education
0   22   30000                 1    Male           Pune  Bachelors
1   25   55000                 2  Female         Mumbai    Masters
2   28   58000                 3  Female  Sambhajinagar  Bachelors
3   35   90000                 7    Male        Jalgaon        PhD
4   40   35000                10  Female          Dhule    Masters

In [14]:
from sklearn.preprocessing import MinMaxScaler
import pandas as pd

df = pd.DataFrame({'Salary':[20000, 35000, 48000, 60000]})
scaler = MinMaxScaler()
df['Salary_Norm'] = scaler.fit_transform(df[['Salary']])
print(df)

   Salary  Salary_Norm
0   20000        0.000
1   35000        0.375
2   48000        0.700
3   60000        1.000

In [16]:
from sklearn.preprocessing import StandardScaler
import pandas as pd

df = pd.DataFrame({'Age':[22,25,28,35]})
scaler = StandardScaler()
df['Age_Std'] = scaler.fit_transform(df[['Age']])
df

   Age   Age_Std
0   22 -1.140647
1   25 -0.518476
2   28  0.103695
3   35  1.555428

In [20]:
# encoding categorial feature
import pandas as pd
from sklearn.preprocessing import LabelEncoder

# Sample dataset
df = pd.DataFrame({
    'Name': ['Samarth', 'Nirmala', 'Sita', 'Ram'],
    'Gender': ['Male', 'Female', 'Female', 'Female']
})

# Apply Label Encoding
le = LabelEncoder()
df['Gender_Label'] = le.fit_transform(df['Gender'])

print(df)

      Name  Gender  Gender_Label
0  Samarth    Male             1
1  Nirmala  Female             0
2     Sita  Female             0
3      Ram  Female             0

In [22]:
df.drop('Gender',axis=1,inplace=True)
df

      Name  Gender_Label
0  Samarth             1
1  Nirmala             0
2     Sita             0
3      Ram             0

In [24]:
# Simple Example: One Hot Encoding using sklearn

import pandas as pd
from sklearn.preprocessing import OneHotEncoder

# Sample dataset
data = {'City': ['Pune', 'Mumbai', 'Delhi', 'Pune']}
df = pd.DataFrame(data)
print("Original Data:")
print(df)

# Initialize the encoder
encoder = OneHotEncoder(sparse_output=False)

# Transform the data
encoded = encoder.fit_transform(df[['City']])

# Convert encoded data to DataFrame
encoded_df = pd.DataFrame(encoded, columns=encoder.get_feature_names_out(['City']))

# Combine with original data
final_df = pd.concat([df, encoded_df], axis=1)

print("\nOne Hot Encoded Data:")
print(final_df)

Original Data:
     City
0    Pune
1  Mumbai
2   Delhi
3    Pune

One Hot Encoded Data:
     City  City_Delhi  City_Mumbai  City_Pune
0    Pune         0.0          0.0        1.0
1  Mumbai         0.0          1.0        0.0
2   Delhi         1.0          0.0        0.0
3    Pune         0.0          0.0        1.0

In [26]:
import pandas as pd

# Sample Data
data = {'City': ['Pune', 'Mumbai', 'Delhi', 'Pune']}
df = pd.DataFrame(data)

# One Hot Encoding in Binary Format
encoded_df = pd.get_dummies(df, columns=['City']).astype(int)

print(encoded_df)

   City_Delhi  City_Mumbai  City_Pune
0           0            0          1
1           0            1          0
2           1            0          0
3           0            0          1